views/produksi1/_form.php

SELECT * FROM `material` WHERE `flag`=1
SELECT * FROM `product` WHERE (`flag`=1) AND (`package`=0)
---

    <?php $form = ActiveForm::begin(); ?>

    <?= $form->field($model, 'id_material')->dropDownList(
        arrayHelper::map(Material::find()->where(['flag' => 1])->all(), 'id_material', 'kode'),
        ['prompt'=>'Pilih kode material']
    ) ?>

    <?= $form->field($model, 'jumlah_material')->textInput() ?>

    <?= $form->field($model, 'id_half_product')->dropDownList(
        arrayHelper::map(Product::find()->where(['flag' => 1,'package' => 0])->all(), 'id_product', 'kode'),
        ['prompt'=>'Pilih kode half product']
    ) ?>