controllers/AkunController.php

SELECT * FROM `akun` WHERE `username`='admin5'
INSERT INTO `akun` (`username`, `password`, `role`, `flag`) VALUES ('admin5', '26a91342190d515231d7238b0c5438e1', 'admin', 1)
---
    public function actionCreate()
    {
        if(Yii::$app->user->isGuest){
               return $this->redirect(Yii::$app->params['base'].'web');
            }
        if(Yii::$app->user->identity->role != 'admin'){
               return $this->redirect(Yii::$app->params['base'].'web');
            }
        $model = new Akun();
        $model->flag = 1;

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

        } else {
            if($model->username != '' && $model->password != '' && $model->confirm_password != '' && $model->role != '' && $model->flag == 1 && $model->password == $model->confirm_password)
             {

                if(Akun::find()->where(['username' => $model->username])->one()==null)
                {
                   Yii::$app->db->createCommand()->insert('akun',['username'=>$model->username,'password'=>md5($model->password),'role'=>$model->role,'flag'=>1])->execute();