controllers/MaterialController.php

INSERT INTO `material` (`kode`, `nama`, `tebal`, `jenis_plat`) VALUES ('003', 'mmo', 23, 'gg')
---
    public function actionCreate()
    {
        $model = new Material();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {