controllers/Produksi2Controller.php

    public function actionCreate()
    {
        if(Yii::$app->user->isGuest){
               return $this->redirect(Yii::$app->params['base'].'web');
            }
        if(Yii::$app->user->identity->role != 'user'){
               return $this->redirect(Yii::$app->params['base'].'web');
            }

        $model = new Produksi2();
        $model->flag = 1;

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
        } else {
            if($model->id_half_product != '' && $model->jumlah_half_product != '' && $model->id_product != '' && $model->jumlah_terbuat != '' && $model->flag == 1)
               {

                   $model->waktu = new Expression('NOW()');

                   $waste = $model->jumlah_half_product - $model->jumlah_terbuat;

                   Yii::$app->db->createCommand()->insert('produksi_2',['waktu'=>$model->waktu, 'jumlah_half_product'=>$model->jumlah_half_product,'jumlah_terbuat'=>$model->jumlah_terbuat,'waste'=>$waste,'id_user'=> Yii::$app->user->identity->id_akun,'flag'=>1])->execute();

                   $model2 = Produksi2::findOne(['waktu'=>$model->waktu, 'id_user'=>Yii::$app->user->identity->id_akun]);

                   Yii::$app->db->createCommand()->insert('proses_produksi_2',['id_half_product'=>$model['id_half_product'], 'id_produksi_2'=>$model2['id_produksi_2'],'id_product'=>$model['id_product']])->execute();

                   $inventory_hp = Inventory_product::findOne(['id_product'=>$model->id_product]);
                   $hp =  $inventory_hp->total - $model->jumlah_half_product;

                   Yii::$app->db->createCommand()->update('Inventory_product', ['total' => $hp], ['id_product'=>$model->id_half_product] )->execute();

                   $inventory_p = Inventory_product::findOne(['id_product'=>$model->id_product]);
                   $p = $model->jumlah_terbuat + $inventory_p->total;

                   Yii::$app->db->createCommand()->update('Inventory_product', ['total' => $p], ['id_product'=>$model->id_product] )->execute();
---
INSERT INTO `produksi_2` (`waktu`, `jumlah_half_product`, `jumlah_terbuat`, `waste`, `id_user`, `flag`) VALUES (NOW(), 50, 45, 5, 66, 1)
SELECT * FROM `produksi_2` WHERE (`waktu`=NOW()) AND (`id_user`=66)
SELECT * FROM `inventory_product` WHERE `id_product`='9'
UPDATE `Inventory_product` SET `total`=-50 WHERE `id_product`='8'
UPDATE `Inventory_product` SET `total`=45 WHERE `id_product`='9'