controllers/Produksi1Controller.php

    public function actionCreate()
    {
        if(Yii::$app->user->isGuest){
               return $this->redirect(Yii::$app->params['base'].'web');
            }
        if(Yii::$app->user->identity->role != 'user'){
               return $this->redirect(Yii::$app->params['base'].'web');
            }

        $model = new Produksi1();
        $model->flag = 1;

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
        } else {
            if($model->id_material != '' && $model->jumlah_material != '' && $model->id_half_product != '' && $model->jumlah_terbuat != '' && $model->flag == 1 && $model->waste != '')
               {

                   $model->waktu = new Expression('NOW()');

                   Yii::$app->db->createCommand()->insert('produksi_1',['waktu'=>$model->waktu, 'jumlah_material'=>$model->jumlah_material,'jumlah_terbuat'=>$model->jumlah_terbuat,'waste'=>$model->waste,'id_user'=> Yii::$app->user->identity->id_akun,'flag'=>1])->execute();

                   $model2 = Produksi1::findOne(['waktu'=>$model->waktu, 'id_user'=>Yii::$app->user->identity->id_akun]);
                   // $material = Material::findOne(['id_material'=>$model->id_material]);
                   // $half_product = Product::findOne(['id_product'=>$model->id_half_product, 'package'=>'0']);

                   Yii::$app->db->createCommand()->insert('proses_produksi_1',['id_material'=>$model['id_material'], 'id_produksi_1'=>$model2['id_produksi_1'],'id_product'=>$model['id_half_product']])->execute();

                   $inventory_mat = Inventory_material::findOne(['id_material'=>$model->id_material]);
                   $mat =  $inventory_mat->total - $model->jumlah_material;

                   Yii::$app->db->createCommand()->update('inventory_material', ['total' => $mat], ['id_material'=>$model->id_material] )->execute();

                   $inventory_hp = Inventory_product::findOne(['id_product'=>$model->id_half_product]);
                   $hp = $model->jumlah_terbuat + $inventory_hp->total;

                   Yii::$app->db->createCommand()->update('Inventory_product', ['total' => $hp], ['id_product'=>$model->id_half_product] )->execute();
---
INSERT INTO `produksi_1` (`waktu`, `jumlah_material`, `jumlah_terbuat`, `waste`, `id_user`, `flag`) VALUES (NOW(), 10, 5, 5, 66, 1)
SELECT * FROM `produksi_1` WHERE (`waktu`=NOW()) AND (`id_user`=66)
SELECT * FROM `material` WHERE `id_material`='51'
SELECT * FROM `inventory_material` WHERE `id_material`='41'
UPDATE `inventory_material` SET `total`=-10 WHERE `id_material`='41'
SELECT * FROM `inventory_product` WHERE `id_product`='12'
UPDATE `Inventory_product` SET `total`=65 WHERE `id_product`='12'