controllers/SupplierController.php

    public function actionCreate()
    {
        if(Yii::$app->user->isGuest){
               return $this->redirect(Yii::$app->params['base'].'web');
            }
        if(Yii::$app->user->identity->role != 'user'){
               return $this->redirect(Yii::$app->params['base'].'web');
            }

        $model = new Supplier();
        $model->flag = 1;

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `supplier` (`flag`, `nama`, `alamat`, `contact`) VALUES (1, 'AC', 'DWAE', '21')