views/pesan/index.php

SELECT * FROM `akun` WHERE (`flag`=1) AND (`role`='user')
---
        <?php $form = ActiveForm::begin(); ?>

        <div class="col-lg-3">
        <?= $form->field($model, 'id_user')->dropDownList(
            arrayHelper::map(Akun::find()->where(['flag'=>1, 'role'=> 'user'])->all(), 'id_akun', 'username'),
            ['prompt'=> 'Pilih User']
        ) ?>