views/produksi2/_form.php

SELECT * FROM `product` WHERE (`flag`=1) AND (`package`=0)
---

    <?php $form = ActiveForm::begin(); ?>

    <?= $form->field($model, 'id_half_product')->dropDownList(
        arrayHelper::map(Product::find()->where(['flag' => 1,'package' => 0])->all(), 'id_product', 'kode'),
        ['prompt'=>'Pilih kode half product']
    ) ?>