models/User.php

    public static function findIdentity($id){
        return User::findOne(['id_akun'=>$id]);
---
SELECT * FROM `akun` WHERE `id_akun`=43